benchmarks/k6/results/release-v1.1.0/normal-transfer.stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/k6/normal-transfer.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * normal_transfer: 20 looping VUs for 30s (gracefulStop: 30s)


Run               [ 100% ] setup()
normal_transfer   [   0% ]

running (0m02.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
normal_transfer   [   2% ] 20 VUs  00.7s/30s

running (0m03.0s), 20/20 VUs, 77 complete and 0 interrupted iterations
normal_transfer   [   6% ] 20 VUs  01.7s/30s

running (0m04.0s), 20/20 VUs, 132 complete and 0 interrupted iterations
normal_transfer   [   9% ] 20 VUs  02.7s/30s

running (0m05.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
normal_transfer   [  12% ] 20 VUs  03.7s/30s

running (0m06.0s), 20/20 VUs, 269 complete and 0 interrupted iterations
normal_transfer   [  16% ] 20 VUs  04.7s/30s

running (0m07.0s), 20/20 VUs, 339 complete and 0 interrupted iterations
normal_transfer   [  19% ] 20 VUs  05.7s/30s

running (0m08.0s), 20/20 VUs, 375 complete and 0 interrupted iterations
normal_transfer   [  22% ] 20 VUs  06.7s/30s

running (0m09.0s), 20/20 VUs, 452 complete and 0 interrupted iterations
normal_transfer   [  26% ] 20 VUs  07.7s/30s

running (0m10.0s), 20/20 VUs, 514 complete and 0 interrupted iterations
normal_transfer   [  29% ] 20 VUs  08.7s/30s

running (0m11.0s), 20/20 VUs, 573 complete and 0 interrupted iterations
normal_transfer   [  32% ] 20 VUs  09.7s/30s

running (0m12.0s), 20/20 VUs, 657 complete and 0 interrupted iterations
normal_transfer   [  36% ] 20 VUs  10.7s/30s

running (0m13.0s), 20/20 VUs, 710 complete and 0 interrupted iterations
normal_transfer   [  39% ] 20 VUs  11.7s/30s

running (0m14.0s), 20/20 VUs, 765 complete and 0 interrupted iterations
normal_transfer   [  42% ] 20 VUs  12.7s/30s

running (0m15.0s), 20/20 VUs, 841 complete and 0 interrupted iterations
normal_transfer   [  46% ] 20 VUs  13.7s/30s

running (0m16.0s), 20/20 VUs, 926 complete and 0 interrupted iterations
normal_transfer   [  49% ] 20 VUs  14.7s/30s

running (0m17.0s), 20/20 VUs, 969 complete and 0 interrupted iterations
normal_transfer   [  52% ] 20 VUs  15.7s/30s

running (0m18.0s), 20/20 VUs, 1041 complete and 0 interrupted iterations
normal_transfer   [  56% ] 20 VUs  16.7s/30s

running (0m19.0s), 20/20 VUs, 1089 complete and 0 interrupted iterations
normal_transfer   [  59% ] 20 VUs  17.7s/30s

running (0m20.0s), 20/20 VUs, 1173 complete and 0 interrupted iterations
normal_transfer   [  62% ] 20 VUs  18.7s/30s

running (0m21.0s), 20/20 VUs, 1261 complete and 0 interrupted iterations
normal_transfer   [  66% ] 20 VUs  19.7s/30s

running (0m22.0s), 20/20 VUs, 1354 complete and 0 interrupted iterations
normal_transfer   [  69% ] 20 VUs  20.7s/30s

running (0m23.0s), 20/20 VUs, 1472 complete and 0 interrupted iterations
normal_transfer   [  72% ] 20 VUs  21.7s/30s

running (0m24.0s), 20/20 VUs, 1561 complete and 0 interrupted iterations
normal_transfer   [  76% ] 20 VUs  22.7s/30s

running (0m25.0s), 20/20 VUs, 1686 complete and 0 interrupted iterations
normal_transfer   [  79% ] 20 VUs  23.7s/30s

running (0m26.0s), 20/20 VUs, 1767 complete and 0 interrupted iterations
normal_transfer   [  82% ] 20 VUs  24.7s/30s

running (0m27.0s), 20/20 VUs, 1882 complete and 0 interrupted iterations
normal_transfer   [  86% ] 20 VUs  25.7s/30s

running (0m28.0s), 20/20 VUs, 1988 complete and 0 interrupted iterations
normal_transfer   [  89% ] 20 VUs  26.7s/30s

running (0m29.0s), 20/20 VUs, 2085 complete and 0 interrupted iterations
normal_transfer   [  92% ] 20 VUs  27.7s/30s

running (0m30.0s), 20/20 VUs, 2175 complete and 0 interrupted iterations
normal_transfer   [  96% ] 20 VUs  28.7s/30s

running (0m31.0s), 20/20 VUs, 2256 complete and 0 interrupted iterations
normal_transfer   [  99% ] 20 VUs  29.7s/30s
time="2026-08-17T18:26:56+05:30" level=info msg="[normal-transfer] completed: 0 -> 2063 (retries: 0 -> 8965, exhausted: 0 -> 231)" source=console


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<500' p(95)=560.32ms

    http_req_failed
    ✗ 'rate<0.01' rate=9.24%


  █ TOTAL RESULTS 

    checks_total.......: 2498   79.359275/s
    checks_succeeded...: 90.75% 2267 out of 2498
    checks_failed......: 9.24%  231 out of 2498

    ✓ principal created (201)
    ✓ api key issued (201)
    ✓ account created (201)
    ✓ funded (201)
    ✓ metrics ok (200)
    ✗ transfer succeeded (201)
      ↳  89% — ✓ 2063 / ✗ 231

    HTTP
    http_req_duration..............: avg=148.94ms min=576µs    med=49.39ms  max=1.1s     p(90)=468.92ms p(95)=560.32ms
      { expected_response:true }...: avg=110.04ms min=576µs    med=35.8ms   max=879.41ms p(90)=338.08ms p(95)=458.96ms
    http_req_failed................: 9.24%  231 out of 2498
    http_reqs......................: 2498   79.359275/s

    EXECUTION
    iteration_duration.............: avg=262.2ms  min=107.38ms med=165.44ms max=1.21s    p(90)=578.51ms p(95)=672.08ms
    iterations.....................: 2294   72.878374/s
    vus............................: 20     min=0           max=20
    vus_max........................: 20     min=20          max=20

    NETWORK
    data_received..................: 1.2 MB 38 kB/s
    data_sent......................: 1.0 MB 32 kB/s



running (0m31.5s), 00/20 VUs, 2294 complete and 0 interrupted iterations
normal_transfer ✓ [ 100% ] 20 VUs  30s
time="2026-08-17T18:26:57+05:30" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed' have been crossed"